In [ ]:
import pandas as pd
import seaborn as sns
import csv, sqlite3

In [14]:
conn = sqlite3.connect("socioeconomic.db")

In [15]:
df = pd.read_csv('https://data.cityofchicago.org/resource/jcxq-k9xf.csv')
df.to_sql("chicago_socioeconomic_data", conn, if_exists ='replace', index = False)

78

In [19]:
query = "select count(*) from chicago_socioeconomic_data"
df = pd.read_sql(query, conn)
df

   count(*)
0        78

In [22]:
query = "select count(*) from chicago_socioeconomic_data where hardship_index > 50.0"
pd.read_sql(query, conn)

   count(*)
0        38

In [23]:
query = "select MAX(hardship_index) from chicago_socioeconomic_data"
pd.read_sql(query, conn)

   MAX(hardship_index)
0                 98.0

In [24]:
query  = "select community_area_name from chicago_socioeconomic_data where hardship_index = ( select max(hardship_index) from chicago_socioeconomic_data );"
pd.read_sql(query, conn)

  community_area_name
0           Riverdale

In [25]:
query  = "SELECT community_area_name FROM chicago_socioeconomic_data WHERE per_capita_income_ > 60000;"
pd.read_sql(query, conn)

  community_area_name
0           Lake View
1        Lincoln Park
2     Near North Side
3                Loop